Show / Hide Table of Contents
Class DappedEnd
Representation of dapped end in IDEA StatiCa Detail
Inheritance
System.Object
OpenObject
OpenElementId
DappedEnd
Inherited Members
 OpenElementId.Id
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.Detail
Assembly: IdeaRS.OpenModel.dll
Syntax
public class DappedEnd : OpenElementId
Constructors
Improve this Doc   View Source
DappedEnd()
Constructor
Declaration
public DappedEnd()
Properties
Improve this Doc   View Source
DappedEndHaunch
Type of haunch on dapped end
Declaration
public DappedEndHaunchType DappedEndHaunch { get; set; }
Property Value
 Type |  Description
 DappedEndHaunchType
Improve this Doc   View Source
GeomId
Id representing geometrical parts of Detail
Declaration
public int GeomId { get; set; }
Property Value
 Type |  Description
 System.Int32
Improve this Doc   View Source
Haunch
Haunch size of dapped end
Declaration
public double Haunch { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
Height
Height of dapped end
Declaration
public double Height { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
MasterComponent
Master component
Declaration
public ReferenceElement MasterComponent { get; set; }
Property Value
 Type |  Description
 ReferenceElement
Improve this Doc   View Source
MasterPoint
Insert point 0 - 1
Declaration
public int MasterPoint { get; set; }
Property Value
 Type |  Description
 System.Int32
Improve this Doc   View Source
Outline
Outline of dapped end
Declaration
public ReferenceElement Outline { get; set; }
Property Value
 Type |  Description
 ReferenceElement
Improve this Doc   View Source
Position
Offset between MasterPoint and InsertPoint
Declaration
public Vector3D Position { get; set; }
Property Value
 Type |  Description
 Vector3D
Improve this Doc   View Source
Rotation
Rotation of dapped end
Declaration
public double Rotation { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
Width
Width of dapped end
Declaration
public double Width { get; set; }
Property Value
 Type |  Description
 System.Double
 Improve this Doc
 View Source